---
kind: method
id: M:Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.RemoveNonContinuousRail(System.Int32)
source: html/82518fa5-b6d2-6a69-00bc-19adb1f9c868.htm
---
# Autodesk.Revit.DB.Architecture.NonContinuousRailStructure.RemoveNonContinuousRail Method

Removes Non-Continuous Rail from the Rail Structure.

## Syntax (C#)
```csharp
public void RemoveNonContinuousRail(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - Non-Continuous Rail index.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - The index index is out of range.